{"data":{"post":{"id":"7be5cc400cf888739b728e28c6ed1585","title":"Confused","content":"<p>I'm a big fan of the command line.</p>\n<h2 id=\"confusion\"><a href=\"#confusion\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Confusion</h2>\n<p>I don't think there's anyone who's as confused as me, or maybe I don't know what confusion is. I actually love the terminal, my first JavaScript project was a command line tool for generating favicons from images. My first articles were on building command line tools.</p>\n<p>I most times write code in nano, not a big fan of vim but I'll definitely learn it one of these days. I suck at designs that's why I don't do frontend development and the likes - I prefer backend API designing and structuring, a skill I'm not sure I'm good at. I also like to learn new languages for curiousity purposes and can't settle down to gain perfect mastery over one - I can't write JavaScript like I used to one time. Maybe because I don't see it as my primary source of income, however, I want to go deep into the command line path and I think that's what \"DevOps\" is all about.</p>\n<p>I might just take a break and decide what path I really want to go into tbh. I can write, I don't take writing seriously like it's a big job - I mean, it's more of premium freelance and it's both talent and passion that's fetching me money from technical writing. But then, I love the command line too much :)</p>\n<h2 id=\"what-next\"><a href=\"#what-next\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>What next?</h2>\n<p>Omo, idk. But one thing is sure, I'll not take part in active development instead I'll level up my skills to fight away this imposter syndrome I've been having recently. Maybe I don't actually know a thing and I'm just blaming <em>imposter syndrome</em>. I have spoken to a Twitter friend on DevOps and I got materials so I'll be going through them for the next couple of months as well as general programming refreshing. I'll also continue technical writing, I have to keep my readers updated.</p>\n<p>Levelling up my skills in general sounds cool to me, no one will hire someone who doesn't know how to do anything y'know. I also need to build confidence in my skills, I lack confidence in my skills and that's why I haven't seen half of my true potential I think. All in all, I hope to get better in the next couple of months and tbh, I'll be putting in real work and documenting every learning on my blog henceforth.</p>\n<h2 id=\"until-when\"><a href=\"#until-when\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Until when?</h2>\n<p>Well, I hope to write on my learnings starting anytime soon - data structures, thoughts, general things etc. I'll leave you in suspense till when I write another article - that's if I have readers abi lol.</p>\n","date":"24 May 2020","timeToRead":2,"image":null}},"context":{}}