{"data":{"post":{"id":"2960d42ca0b740a269f445b871e28e9d","title":"My book is here.","content":"<p>I'm an author now.</p>\n<p><img src=\"https://res.cloudinary.com/laisi/image/upload/v1657957125/ezgif.com-gif-maker_b6ut4t.gif\" alt=\"Dancing without manners\"></p>\n<p>In August 2021, I wrote on my blog that <a href=\"https://www.blog.youngest.dev/read/i-m-writing-a-book\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">I was writing a book</a> on building web APIs with FastAPI. I have written this follow-up blog post informing you that I have completed my debut book.</p>\n<h2 id=\"o-porrr-my-author\"><a href=\"#o-porrr-my-author\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>O porrr, my author</h2>\n<p>Pls, I saw <strong>shege</strong> while writing this book. I've been writing technical articles and documentation for four years, and I kid you not, writing a book isn't as straightforward as a technical article.</p>\n<h2 id=\"shege\"><a href=\"#shege\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Shege?</h2>\n<p>I'm a skilled technical writer, and I wrote most of my published articles you see on the internet in half an hour to an hour. Indeed, I thought it'd be the same for the book, but I was wrong. I spent days writing a paragraph - ridiculous.</p>\n<p>The timeline for this book was five months from September, but I wrote the last draft on the ninth month from the initial draft submission date.</p>\n<p>It's a wonderful process.</p>\n<p>--</p>\n<p>The editorial team is the best I've worked with in an extended period ( the best remains Matt from LogRocker ). Mostly, the editor's feedback is just style fixes, suggestions and minor details, and for a first-time author, it's an exciting feat for me.</p>\n<p>Alhamdulillah.</p>\n<h2 id=\"what-the-book-covers\"><a href=\"#what-the-book-covers\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>What the book covers</h2>\n<p>In bullet points, this is what the book covers:</p>\n<ul>\n<li>Set up a FastAPI application that is fully functional and secure</li>\n<li>Understand how to handle errors from requests and send proper responses in FastAPI</li>\n<li>Integrate and connect your application to a SQL and NoSQL (MongoDB) database</li>\n<li>Perform CRUD operations using SQL and FastAPI</li>\n<li>Manage concurrency in FastAPI applications</li>\n</ul>\n<p>How about you find out in-depth what the book covers by getting the book?</p>\n<h2 id=\"getting-the-book\"><a href=\"#getting-the-book\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Getting the book</h2>\n<p>After all my wahala and sleepless nights, I think it's just proper that you get the book and read it. <em>Sapa ti hook mi atm so I mean, mo le lo some money</em>.</p>\n<blockquote>\n<p>Translation: I'm currently being held hostage by the lack of money. Some money won't be wrong.</p>\n</blockquote>\n<p>The book becomes available to the public from the <strong>29th of July</strong> and can be purchased as either an eBook or paperback on <a href=\"https://www.amazon.com/dp/1801076634\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Amazon</a>.</p>\n<p>I'm happy to sign your paperback copies if you get them :D.</p>\n<h2 id=\"gratitude\"><a href=\"#gratitude\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Gratitude</h2>\n<p>I want to say thank you to:</p>\n<ul>\n<li>My amazing family for everything.</li>\n<li>The fantastic team at Packt.</li>\n<li>My best friends because what will I do without them?</li>\n<li>Biodun for best in friendship, turning up, advice and all-rounder everything.</li>\n<li>Favour, for answering occasional questions and always being there tbh.</li>\n<li>Precious, for introducing me to FastAPI.</li>\n<li>Bolaji, for showing up whenever.</li>\n<li>Ademola and Shedrack, for the encouragement every time.</li>\n<li>Mercy, for her constant encouragement and prayers.</li>\n<li>Aisha, for her constant encouragement and hypes.</li>\n<li>Everybody, for their support :D.</li>\n</ul>\n<hr>\n<p>Please buy my book: <a href=\"https://www.amazon.com/dp/1801076634\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Click me to buy Abdul's book</a>.</p>\n","date":"16 July 2022","timeToRead":2,"image":null}},"context":{}}