{"data":{"post":{"id":"f15845bc4d80fef53229737a6e0885e1","title":"I'm writing a book.","content":"<p>Hola. I'm writing a book.</p>\n<p>The majority of my technical articles is based on FastAPI. I began writing FastAPI around August 2020. It's a smooth and easy to learn framework.</p>\n<p>I found FastAPI to be very simple and easy to learn. This is probably as a result of my ability to learn <em>selective</em> things fast. Maybe not selective, but things that interest me. It has an easier learning curve as opposed to its alternatives anyways.</p>\n<p>I have authored a couple of FastAPI articles: authentication, connecting to database and deploying the applications to various platforms - Okteto and Heroku. I have received positive comments via e-mail, LinkedIn and Twitter regarding my articles on FastAPI.</p>\n<p>I have also received emails with questions, requests and the likes from readers and developers who have issues working with FastAPI. Most of these issues, questions and requests have been covered in most of my articles. However, some questions are usually different or of varying difficulty. I try my best to answer these mails and make sure everyone is satisfied. Sadly, I forget to respond to some mails :( </p>\n<p>Some weeks ago, I conceived the thought of creating a FastAPI course that'll discuss the problems those who have mailed me over time had. I had started working towards it but stopped due to some engagements. I postponed it mentally.</p>\n<p>Enough talk.</p>\n<h2 id=\"packt\"><a href=\"#packt\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Packt.</h2>\n<p>I have received a collaboration request from Packt to write a book on building web APIs with FastAPI. The mail came as a shocker because I was working towards that goal but mentally postponed it due to the modalities involved.</p>\n<p>I'm glad to announce that I have accepted this request and will be working towards this project in the next couple of months. </p>\n<blockquote>\n<p>I am most importantly glad that my technical reviewers are pioneers of great work and, the developer community - wonderful folks.</p>\n</blockquote>\n<p>This will be the first out of the many of the books I intend to publish. I shall cover the very basics to intermediary/advanced level of FastAPI.</p>\n<p>In advance, I beseech the support of the developer community in large, to <em>famz</em> my book when it's out.</p>\n<h2 id=\"jots\"><a href=\"#jots\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Jots.</h2>\n<p>I shall try my best to document all my learnings. I'm excited and equally tensed about this. Can I do this? yes.</p>\n<p>It's a book, a book.</p>\n<p>Also, buy my book when it's out. Not only that, sincere reviews are expected from you if you purchase it.</p>\n<h2 id=\"faqs\"><a href=\"#faqs\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>FAQs</h2>\n<ol>\n<li>\n<p>Will there be giveaway?</p>\n<ul>\n<li>If you buy my book, why not?</li>\n</ul>\n</li>\n<li>\n<p>Do I promise to give you a book worth your coins?</p>\n<ul>\n<li>Absolutely.</li>\n</ul>\n</li>\n</ol>\n<h2 id=\"conclusion\"><a href=\"#conclusion\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Conclusion</h2>\n<p>I look forward to this project becoming a success. Cheers.</p>\n","date":"11 August 2021","timeToRead":2,"image":null}},"context":{}}