{"data":{"post":{"id":"0cce094e4ce3711c0adcbce309a95d07","title":"Beginning DevOps - Day 1","content":"<p>In the <a href=\"/read/confused\">previous post</a>, I stated that I'll be deciding what part to take next. Well, I'll be working on a path to becoming a DevOps engineer. I started today and this post is about what I have done today.</p>\n<h2 id=\"yesterday\"><a href=\"#yesterday\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Yesterday,</h2>\n<p>I got a reference article from my new virtual mentor that discusses the pathway to DevOps, it was a four part article with detailed information on what DevOps is about, skillsets needed, platforms used etc.</p>\n<p>DevOps can be said to be engineering cloud infrastructures and automating application and software developments and productions via <em>pipelines</em>. It basically is building systems virtually in a confined environment ( this is what I understand from what I've seen today).</p>\n<blockquote>\n<p>Pipelines ( to me ) is the path followed by the application to deployment. Since well, pipes carry material and in DevOps, these pipelines refers to set of automated instructions and co.</p>\n</blockquote>\n<p>The three fundamental requirements to becoming a SevOps engineer are:</p>\n<ul>\n<li>Solid understanding of the cloud and how it works - Aws, Google Cloud etc</li>\n<li>Solid understadning of the Linux ( Unix type ) operating system.</li>\n<li>Solid understanding of a scripting language such as Python, Go etc.</li>\n</ul>\n<p>I only pass the last two requirements above and I'll be learning what the Cloud is all about, AWS is more popular but an idea of both is good. I believe the cloud works the same way, bunch of instances, buckets etc. I also will be furthering my knowledge of both Python and Go: there isn't any specific language choice for DevOps but these two are recommended.</p>\n<hr>\n<h2 id=\"today\"><a href=\"#today\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Today,</h2>\n<p>I began learning what the cloud is all about at the <a href=\"https://aws.training\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">AWS training website</a> and so far I have completed the <strong>Introduction to Cloud</strong> and <strong>AWS Core services</strong> modules. In those two modules, I learnt what an instance is, volumes, buckets as well as VPC. I also learnt how to use <strong>ssh</strong>.</p>\n<h3 id=\"elastic-compute-cloud\"><a href=\"#elastic-compute-cloud\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Elastic Compute Cloud</h3>\n<p>I learned about the Elastic Compute CLoud ( EC2 ) which is a virtual machine hosted in the cloud ( cloud - physical servers not in your reach ). The EC2 instances are containers containing these virtual machiens - usually Linux, you could build your own image too. I also learned about connecting to my EC2 instances on my machine locally, attaching IAM roles to allow specific operations defined by me on the EC2 console. I also learned about regions and available zones</p>\n<p>The EC2 instacnes are machiens where you can perform all linux operations such as file operations, code running etc. You also get to access your s3 bucket from it if your aws has been configured and all the necessary permissions and roles have been set.</p>\n<h3 id=\"simple-service-storage\"><a href=\"#simple-service-storage\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Simple Service Storage</h3>\n<p>The S3 is basically a file server from Amazon, Google also offers smoething similar. I learned how to create S3 buckets and upload data from it both online and locally using the aws cli. You can also access the bucket from your EC2 instance and locally.</p>\n<h3 id=\"aws-cli\"><a href=\"#aws-cli\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>AWS cli</h3>\n<p>The installation of the cli was quite straightforward. I also configured it with the details I got from creating a user from the aws console. I am yet to explore all the available use case of the cli just yet. I definitely will use it more as I journey into DevOps. I used it to list the available buckets, upload files to it and sync through the buckets. It's an amazing cli so far.</p>\n<h3 id=\"yup\"><a href=\"#yup\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Yup</h3>\n<p>Today was very interesting, learned so many things, made mistakes and corrected them. I read docs and googled what I didn't understand too. I hope I'm not too excited but I mean, spending all my day on my terminal is so fulfilling tbh, I hope DevOps isn't too hard and these fundamentals aren't deceiving me sha. Well, I'll continue to update the blog with my daily* learnings.</p>\n<blockquote>\n<p>daily* - it might be sequential or a progression.</p>\n</blockquote>\n<p>Thanks for reading!</p>\n","date":"26 May 2020","timeToRead":3,"image":null}},"context":{}}