{"data":{"post":{"id":"13d8bc6fade09ae678588fa690fb97a8","title":"Beginning DevOps - Day 7","content":"<p>In the <a href=\"/read/beginning-dev-ops-day-5\">previous post</a>, I was trying to get ansible to work and spoilt my machine, lmao.</p>\n<h2 id=\"today\"><a href=\"#today\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Today</h2>\n<p>I actually didn't do any study today tbh. I took today off to rest and read another book, \"Black Swan\". However, I deployed a node app with docker.</p>\n<p><img src=\"https://res.cloudinary.com/adeshina/image/upload/v1597157704/ktfjinowtjpkyxrj8pye.png\" alt=\"Hello from docker\"></p>\n<p>Docker seems to be the most friendly tool to me tbh, I so much love it haha! Well, this post will be a recap:</p>\n<h2 id=\"this-week\"><a href=\"#this-week\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>This week</h2>\n<p>I started this journey after taking my time to decide what I want, the console has been cool. I mean, it's sweeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeet, I reached out on Twitter, and got resources and I have two go to mentors who are always available to answer my questoins - Bakare &#x26; Obinna. I also have a current reader, Etin!</p>\n<ul>\n<li>I learned what DevOps is, and it's constituents - CI, CD, Automation, Containerization, Cloud Computing etc.</li>\n<li>I learned about AWS &#x26; the services provided. I also created an instance, bucket and a volume.</li>\n<li>I learned about roles, permissions and policies in AWS in the IAM section.</li>\n<li>I learned how to use Jenkins, a really stressful CI tool tbh.</li>\n<li>I learned what Ansible is and successfully destroyed my machine with it.. I mean, <code class=\"language-text\">sudo</code>.</li>\n<li>I learned patience. I can't learn anything without patience and DevOps requires patience and practice.</li>\n</ul>\n<hr>\n<p>I had one of the best weeks in 2020 tbh. I mean, it was fun all through, and I'm pretty sure there's more fun ahead. I have also learned that there are more tools, and it depends on which works for you and/or gets the job done easily.</p>\n<p>Although, there are preferences based on popularity, flexibility etc. Choose, and understand that which works for you.</p>\n<p>I still have a lot to learn and today was basically about Docker. </p>\n","date":"1 June 2020","timeToRead":1,"image":null}},"context":{}}