{"data":{"post":{"id":"b39f961ea50b1f877cb501da200ed23f","title":"Beginning DevOps - Day 6","content":"<p>In the <a href=\"/read/beginning-dev-ops-day-5\">previous post</a>, I was trying to get my ssh to work with ansible.</p>\n<h2 id=\"today\"><a href=\"#today\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Today</h2>\n<p>So today, I decided to continue with automation with ansible. I explored the ansible-playbook package and created an inventory, roles and a playbook ultimately.</p>\n<p>In the book, I was to automate two tasks:</p>\n<ul>\n<li>Create users</li>\n<li>Install some packages.</li>\n</ul>\n<p>I had difficulties setting up the ssh again but well, I was able to fix it. The creating users tasks required the use of <code class=\"language-text\">sudo</code>. I mean, <code class=\"language-text\">sudo</code> is actually a bastard - shey it can't revert my mistakes ni.</p>\n<h2 id=\"creating-users--doom\"><a href=\"#creating-users--doom\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Creating users &#x26; Doom...</h2>\n<p>My default user on my machine is <strong>Youngestdev</strong>, in the book, we're to create a user to have its own enviroment, ssh keys etc... I was like well, let's get to it. I was actually tired ( sleep deprived due to one or two things ) and I wanted to just finish the chapter so I can begin a new one tomorrow.</p>\n<p>Mumu me went to use my default user name as the user to be created giving it new UID, GID, and file permissions.. I didn't realise until I woke up - <strong>I had granted a read-only permission to my disk\"</strong>.</p>\n<h2 id=\"sighs\"><a href=\"#sighs\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Sighs.</h2>\n<p>I had shutdown already and when I restarted the laptop, I couldn't open applications except the terminal. I had to reinstall my OS, luckily, I don't have any important data ( I think.. ) as it's a fresh installation.</p>\n<p>Now, I have a new OS installed and didn't download that book again for these reasons:</p>\n<ul>\n<li>Outdated information</li>\n<li>Lack of cautionary messages</li>\n<li>Not beginner friendly</li>\n</ul>\n<p>I'll just tread carefully with these books and use more of documentations tbh, I should've known better than to run <code class=\"language-text\">sudo</code> carelessly but, mistakes happens and that's a mistake I def won't make again.. hopefully.</p>\n<h2 id=\"next-steps\"><a href=\"#next-steps\" aria-hidden=\"true\"><span class=\"icon icon-link\"></span></a>Next steps</h2>\n<p>I'll set up everything again - ssh, docker, ansible. I'll be taking my time more carefully to study books before executing commands and run to the documentation as those are the materials that have aided in the last few days.</p>\n<p>I got a new book, and I'll take my time to review it before I decide to either keep it or trash it.</p>\n<hr>\n<p>Thanks for reading, Etin!</p>\n","date":"31 May 2020","timeToRead":2,"image":null}},"context":{}}